; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-5)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 )
(:init
(on b1 b5)
(ontable b2)
(on b3 b2)
(on b4 b3)
(on b5 b4)
(clear b1)
)
(:goal
(and
(on b5 b3))
)
)

; plan
1. (move-b-to-t b1 b5)
   deleted: (on b1 b5)
   added: (ontable b1) (clear b5)
   goals met: 0 of 1
2. (move-b-to-t b5 b4)
   deleted: (on b5 b4)
   added: (ontable b5) (clear b4)
   goals met: 0 of 1
3. (move-b-to-b b4 b3 b1)
   deleted: (clear b1) (on b4 b3)
   added: (on b4 b1) (clear b3)
   goals met: 0 of 1
4. (move-t-to-b b5 b3)
   deleted: (clear b3) (ontable b5)
   added: (on b5 b3)
   goals met: 1 of 1
